# Q1.
## List any five functions of the pandas library with execution.

Ans :

In [34]:
import pandas as pd
df= pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [36]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [37]:
df.tail()

     PassengerId  Survived  Pclass                                      Name  ...      Ticket   Fare  Cabin  Embarked
886          887         0       2                     Montvila, Rev. Juozas  ...      211536  13.00    NaN         S
887          888         1       1              Graham, Miss. Margaret Edith  ...      112053  30.00    B42         S
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"  ...  W./C. 6607  23.45    NaN         S
889          890         1       1                     Behr, Mr. Karl Howell  ...      111369  30.00   C148         C
890          891         0       3                       Dooley, Mr. Patrick  ...      370376   7.75    NaN         Q

[5 rows x 12 columns]

In [38]:
df.describe()

       PassengerId    Survived      Pclass         Age       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [39]:
df.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [41]:
df.memory_usage()

Index           128
PassengerId    7128
Survived       7128
Pclass         7128
Name           7128
Sex            7128
Age            7128
SibSp          7128
Parch          7128
Ticket         7128
Fare           7128
Cabin          7128
Embarked       7128
dtype: int64

# Q2. 
## Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

Ans :

In [52]:
data={'A':[1, 2, 3], 'B':[4,5,6], 'c':[7,8,9]}
df=pd.DataFrame(data)
print(df)
#df.reset_index(drop=True)
df.index=range(1, len(df)*2, 2)
df

   A  B  c
0  1  4  7
1  2  5  8
2  3  6  9

   A  B  c
1  1  4  7
3  2  5  8
5  3  6  9

# Q3. 
## You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
## For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

Ans :

In [69]:
df=pd.DataFrame({'valuse':[10,20,30,40,50]})
df[0:3].sum()

valuse    60
dtype: int64

In [74]:
# by defination
def sum_first_three(df):
    c=0
    sum_of=0
    for i in df['valuse']:
        if c<3:
            sum_of+=i
            c+=1
    return sum_of
df=pd.DataFrame({'valuse':[10,20,30,40,50]})
print("sum of first 3 no. = ")
sum_first_three(df)

sum of first 3 no. =

60

# Q4. 
## Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

Ans :

In [88]:
def count_of_word(df):
    df['World_count']=df['Text'].str.split().apply(len)
    return df
    
data = {'Text': ['This is a sentence', 'Another sentence', 'And a third sentence']}
df=pd.DataFrame(data)
count_of_word(df)

                   Text  World_count
0    This is a sentence            4
1      Another sentence            2
2  And a third sentence            4

In [93]:
def count_of_Alphabet(df):
    df["total_alphabets"]=df['Text'].str.strip().apply(len)
    return df
data = {'Text': ['This is a sentence', 'Another sentence', 'And a third sentence']}
df=pd.DataFrame(data)
count_of_Alphabet(df)

                   Text  total_alphabets
0    This is a sentence               18
1      Another sentence               16
2  And a third sentence               20

# Q5. 
## How are DataFrame.size() and DataFrame.shape() different?

Ans :

Both __DataFrame.size__ and __DataFrame.shape__ are attributes of Pandas DataFrame that are used to obtain information about the size and shape of the DataFrame. However, they provide different information about the DataFrame.

__DataFrame.size__ returns the number of elements in the DataFrame, which is equal to the number of rows multiplied by the number of columns. It does not provide any information about the shape or dimensions of the DataFrame.

On the other hand, __DataFrame.shape__ returns a tuple of two integers, which represent the number of rows and columns in the DataFrame, respectively. So, __DataFrame.shape__ provides information about the shape or dimensions of the DataFrame.

# Q6. 
## Which function of pandas do we use to read an excel file?

Ans :

We can use the read_excel() function of pandas to read an Excel file into a pandas DataFrame. This function allows us to read both XLS and XLSX files.

# Q7. 
## You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. 
## The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

Ans :

In [104]:
def Extract_user_name(df):
    df["UserName"]=df["Email"].str.split('@').str[0]
    return df

# create a sample DataFrame with 'Email' column
data = {'Email': ['john.doe@example.com', 'jane.smith@example.com', 'bob.johnson@example.com']}
df=pd.DataFrame(data)
Extract_user_name(df)

                     Email     UserName
0     john.doe@example.com     john.doe
1   jane.smith@example.com   jane.smith
2  bob.johnson@example.com  bob.johnson

# Q8. 
## You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:

| |A |B |C|
|:-:|:-:|:-:|:-:|
|0 |3 |5 |1 |
| 1| 8|2 |7 |
| 2| 6|9 |4 |
| 3|2 |3 |5 |
| 4| 9|1 |2 |

## Your function should select the following rows: A B C
1 8 2 7

4 9 1 2
## The function should return a new DataFrame that contains only the selected rows.

Ans :

In [114]:
def Selected_row(df):
    new_dataFrame=df[(df['A']>5) & (df['B']<10)]
    return new_dataFrame

# create a sample DataFrame
data = {'A': [3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]}
df = pd.DataFrame(data)
Selected_row(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Q9. 
## Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

Ans :

In [129]:
def Calculate_statestic(df):
    print('Mean= ', df['Values'].mean())
    print("Meadian = ", df['Values'].median())
    print('Standard Deviation = ' , df['Values'].std())

data = {'Values': [1, 2, 3, 4, 5]}
df = pd.DataFrame(data)
Calculate_statestic(df)

Mean=  3.0
Meadian =  3.0
Standard Deviation =  1.5811388300841898

# Q10. 
## Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

Ans :

In [139]:
def add_moving_average(df):
    df['moving_average']=df["Sales"].rolling(window=7, min_periods=1,).mean()
    return df

# create a sample DataFrame
data = {'Date': pd.date_range('2022-01-01', '2022-01-10'), 'Sales': [10, 15, 20, 25, 30, 35, 40, 45, 50, 55]}
df = pd.DataFrame(data)
# call the add_moving_average function
add_moving_average(df)

        Date  Sales  moving_average
0 2022-01-01     10            10.0
1 2022-01-02     15            12.5
2 2022-01-03     20            15.0
3 2022-01-04     25            17.5
4 2022-01-05     30            20.0
5 2022-01-06     35            22.5
6 2022-01-07     40            25.0
7 2022-01-08     45            30.0
8 2022-01-09     50            35.0
9 2022-01-10     55            40.0

# Q11. 
## You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.
## For example, if df contains the following values:

| |Date|
|:-:|:-:|
|0| 2023-01-01|
|1 |2023-01-02|
|2 |2023-01-03|
|3| 2023-01-04|
|4 |2023-01-05|

Your function should create the following DataFrame:

| |Date| Weekday|
|:-:|:-:|:-:|
|0 |2023-01-01 |Sunday|
|1| 2023-01-02| Monday|
2| 2023-01-03 |Tuesday|
|3 |2023-01-04| Wednesday|
|4 |2023-01-05 |Thursday|

The function should return the modified DataFrame.

Ans:

#### Series.dt.day_name(*args, **kwargs)[source]
#### Return the day names with specified locale.

In [5]:
import pandas as pd

def add_weakdyas(df):
     # below returns weekdays returns weekday
    df['weakdays']=df['Date'].dt.day_name()
    return df

df1=pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})
print(df)
# Below changes String Date to datetime format
df['Date']=pd.to_datetime(df['Date'])
df=add_weakdyas(df)

print('\n')
print(df)

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05


        Date   weakdays
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

# Q12. 
## Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

Ans:

In [32]:
df=pd.DataFrame({'Date': ['2023-01-01', '2023-05-02', '2023-07-03', '2023-01-14', '2023-01-25']})
print(df)
print('\n')
print(df[(df['Date']>='2023-01-01') & (df['Date']<='2023-01-31')])

         Date
0  2023-01-01
1  2023-05-02
2  2023-07-03
3  2023-01-14
4  2023-01-25


         Date
0  2023-01-01
3  2023-01-14
4  2023-01-25

In [33]:
# proper programming

import pandas as pd

def select_date_between(df):
    start_date='2023-01-01'
    last_date='2023-01-31'
    mask=(df['Date']>='2023-01-01') & (df['Date']<='2023-01-31')
    return df.loc[mask]

df=pd.DataFrame({'Date': ['2023-01-01', '2023-05-02', '2023-07-03', '2023-01-14', '2023-01-25']})
print(df)
df=select_date_between(df)
print(df)

         Date
0  2023-01-01
1  2023-05-02
2  2023-07-03
3  2023-01-14
4  2023-01-25
         Date
0  2023-01-01
3  2023-01-14
4  2023-01-25

# Q13.
## To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

Ans:

To use the basic functions of pandas, the first and foremost necessary library that needs to be imported is pandas itself. You can import it using the following command:

In [2]:
import pandas as pd

his statement imports the pandas library and gives it an alias pd, which is a common convention in the Python community. With this import statement, you can then use all the basic functions of pandas such as creating a DataFrame, manipulating data within a DataFrame, and performing various types of analyses and transformations on the data.